Documents/ESB/ESB_Consumer_0525/003TestSample/SAMPLE_XML_MUST/BankCard/BC06_BankCardAppRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/BankCard/BankCardAppRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>BankCard</ServiceDomain>  
      <OperationName>BankCardApp</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:BankCardAppRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>BC06</v11:TxnId>  
        <v11:TxnNo>BC0600001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CIFNo>2334567599</v11:CIFNo>  
        <v11:CustPermId>1234544890</v11:CustPermId>  
        <v11:CustChnName>王小明</v11:CustChnName>  
        <v11:CustEngName>Wan ShiaoMing</v11:CustEngName>  
        <v11:BirthDay>1980/01/01</v11:BirthDay>  
        <v11:MobNo>091234567</v11:MobNo>  
        <v11:AddrZip>103</v11:AddrZip>  
        <v11:MailAddr1>台北市大安區</v11:MailAddr1>  
        <v11:MailAddr2>台北市大安區</v11:MailAddr2>  
        <v11:CardType>1</v11:CardType>  
        <v11:DayLmt>1000.0</v11:DayLmt>  
        <v11:MnthLmt>50000.0</v11:MnthLmt>  
        <v11:NonRsrvdFundXferFlg>1</v11:NonRsrvdFundXferFlg>  
        <v11:XbrdrWdlFlg>1</v11:XbrdrWdlFlg>  
        <v11:SmartPayFlg>1</v11:SmartPayFlg>  
        <v11:DlvrMthd>0</v11:DlvrMthd>  
        <v11:DbAcctNo>1231231000000029</v11:DbAcctNo>  
        <v11:HCE>0</v11:HCE>  
        <v11:SMSFlg>1</v11:SMSFlg>  
        <v11:PushAppFlg>0</v11:PushAppFlg>  
        <v11:eMailFlg>0</v11:eMailFlg>  
        <v11:SMSAmt>12.0</v11:SMSAmt>  
        <v11:eMailAddr>123@gmail.com</v11:eMailAddr>  
        <v11:EmrgIssCardFLG>1</v11:EmrgIssCardFLG>  
        <v11:DsgntCardNo>0</v11:DsgntCardNo>  
        <v11:ImgId>1</v11:ImgId>  
        <!--Zero or more repetitions:-->  
        <v11:DbAcctInfo> 
          <v11:DbAcctNo>1111222233334444</v11:DbAcctNo> 
        </v11:DbAcctInfo>  
        <!--Zero or more repetitions:-->  
        <v11:CrBankInfo> 
          <v11:CrBankId>013</v11:CrBankId>  
          <v11:CrAcctNo>2111222233334443</v11:CrAcctNo> 
        </v11:CrBankInfo>  
        <!--Optional:-->  
        <v11:SubAcctFlg>N</v11:SubAcctFlg>  
        <v11:CardGrade>W</v11:CardGrade>  
        <v11:GrpCode>0000</v11:GrpCode>  
        <v11:ElekCardType>0</v11:ElekCardType>  
        <v11:Natl>TW</v11:Natl> 
      </v11:ServiceBody> 
    </v11:BankCardAppRq> 
  </soap:Body> 
</soap:Envelope>
